/******************************************************************************
 * Copyright (C) 2021, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************/

/******************************************************************************
 * @file   main.c
 *
 * @brief  Source file for TRNG example
 *
 * @author MADS Team 
 *
 ******************************************************************************/

/******************************************************************************
 * Include files
 ******************************************************************************/
#include "ddl.h"
#include "trng.h"

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
uint32_t pu32Data0[2] = {0xFFFFFFFF, 0xFFFFFFFF};
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/


/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 ******************************************************************************
 ** \brief  Main function of project
 **
 ** \return uint32_t return value, if needed
 **
 ** This sample
 **
 ******************************************************************************/

int32_t main(void)
{       
    ///< 打开RNG模块时钟门控
    Sysctrl_SetPeripheralGate(SysctrlPeripheralRng, TRUE);
    
    ///< 上电第一次生成随机数必须使用初始化函数生成并获取随机数
    ///< 上电第一次随机数生成并获取
    Trng_Init();
    
    pu32Data0[0] = Trng_GetData0();
    pu32Data0[1] = Trng_GetData1();
    
    ///< 随机数不应该为全0或全1
    if ( (pu32Data0[0] != 0) &&
         (pu32Data0[1] != 0) &&
         (pu32Data0[0] != 0xFFFFFFFF) &&
         (pu32Data0[1] != 0xFFFFFFFF))
    {
        ;
    }
    else
    {
        while(1);
    }
    
    ///< 如果在使用中有多次生成随机数的需要，则在第一次生产随机数后通过如下流程实现和获取随机数
    ///< 非上电第一次随机数生成并获取
    Trng_Generate();
    
    ///< 两次生产的随机数不相同
    if (pu32Data0[0] != Trng_GetData0())
    {
        if(pu32Data0[1] != Trng_GetData1())
        {
            ;
        }
        else
        {
            while(1);
        }

    }
    else
    {
        while(1);
    }
    
    while (1);
}

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/


